{
    "Boxing": {
        "damage": "1D3+DB",
        "techniques": {
            "Hook": "On Extreme Success, target must pass a CON check or be stunned for 1 round.",
            "Jab": "Perform two attacks, each with a Penalty Die.",
            "Uppercut": "If attacker has higher Build, target must pass a DEX check or be knocked prone."
        }
    },
    "Wrestling": {
        "damage": "1D3+DB",
        "techniques": {
            "Grapple": "Successfully grapple the opponent, restricting their movement.",
            "Slam": "After a successful Grapple, throw the opponent to the ground for 1D6 extra damage.",
            "Choke Hold": "Maintain Grapple for 3 rounds; target must pass a CON check or fall unconscious."
        }
    },
    "Judo": {
        "damage": "1D3+DB",
        "techniques": {
            "Throw": "On success, throw opponent to the ground, dealing 1D3 damage and knocking them prone.",
            "Arm Lock": "On Hard Success, lock opponent's arm, preventing them from attacking.",
            "Sweep": "Knock opponent down; they must pass a DEX check to remain standing."
        }
    },
    "Karate": {
        "damage": "1D4+DB",
        "techniques": {
            "Roundhouse Kick": "Deals 1D6 damage, but attacker gets a Penalty Die if it fails.",
            "Counter Attack": "Immediate counter if opponent's attack fails, dealing 1D3 damage.",
            "Disarm": "Attempt to disarm opponent; they must pass a STR check or drop their weapon."
        }
    },
    "Brazilian Jiu-Jitsu": {
        "damage": "1D3+DB",
        "techniques": {
            "Guard": "Enter defensive stance, gaining a Bonus Die against melee attacks.",
            "Arm Bar": "On success, opponent must pass a Hard STR check or take 1D6 damage and be locked.",
            "Rear Naked Choke": "After a successful Grapple, target must pass a Hard CON check or fall unconscious."
        }
    },
    "Muay Thai": {
        "damage": "1D4+DB",
        "techniques": {
            "Knee Strike": "Deals 1D2 extra damage; on Hard Success, target must pass a CON check or lose next action.",
            "Elbow Strike": "50% chance to cause Bleeding, losing 1 HP per round until treated.",
            "Clinching": "Enter clinch, preventing opponent's attacks and allowing automatic Knee Strike each round."
        }
    },
    "Krav Maga": {
        "damage": "1D3+DB",
        "techniques": {
            "Eye Gouge": "On Extreme Success, target must pass a Hard CON check or be temporarily blinded.",
            "Groin Kick": "On success, target must pass a Hard CON check or lose next action due to pain.",
            "Disarm and Control": "Disarm opponent and restrict their movement; they cannot make attacks."
        }
    },
    "Capoeira": {
        "damage": "1D3+DB",
        "techniques": {
            "Spinning Kick": "Target must pass a DEX check or be knocked prone.",
            "Feint": "Opponent receives a Penalty Die on their next Dodge or Block check.",
            "Flip Escape": "On successful Dodge, perform a counterattack dealing 1D3 damage."
        }
    }
}